Tekla.Structures.Model.UI.Picker.PickPointEnum
The possible point pick types.

Tekla.Structures.Model.UI.Picker.PickPointEnum.PICK_ONE_POINT
Pick one point (x,y,z).

Tekla.Structures.Model.UI.Picker.PickPointEnum.PICK_TWO_POINTS
Pick two points.

Tekla.Structures.Model.UI.Picker.PickPointEnum.PICK_POLYGON
Pick multiple points.

Tekla.Structures.Model.UI.Picker.PickPointEnum.PICK_LINE
Pick one line.

Tekla.Structures.Model.UI.Picker.PickPointEnum.PICK_FACE
Pick one face.